WildWestWorld/jk-stm32-template/Module/System/MyRTC.c
#include "stm32f10x.h"                  // Device header
#include <time.h>

uint16_t MyRTC_Time[] = {2023,1,1,23,59,55};

void MyRTC_SetTime(void);				//函数声明


void MyRTC_Init(void){
			/*开启时钟*/
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);		//开启PWR的时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_BKP, ENABLE);		//开启BKP的时钟
	
		/*备份寄存器访问使能*/
	PWR_BackupAccessCmd(ENABLE);							//使用PWR开启对备份寄存器的访问

	
		//给某个寄存器 设置任意值(我们设置是0xA5A5) 如果不是0xA5A5说明断电了/第一次进入
	if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5){//通过写入备份寄存器的标志位，判断RTC是否是第一次配置
	
			//开启LSE
			RCC_LSEConfig(RCC_LSE_ON);							//开启LSE时钟
			
			//读取 开启LSE的标志位
			while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) != SET);
			
			//配置时钟源
			RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);
		 //RTCCLK使能
			RCC_RTCCLKCmd(ENABLE);
			
			
			RTC_WaitForSynchro();								//等待同步
			RTC_WaitForLastTask();								//等待上一次操作完成
				
			//LSE的频率是32.768KHz 也就是32768Hz
			//所以分频只要进行32768分频就是1Hz
				RTC_SetPrescaler(32768 - 1);						//设置RTC预分频器，预分频后的计数频率为1Hz
				RTC_WaitForLastTask();								//等待上一次操作完成
			
			//设置初始时间
			/*RTC_SetCounter(1672588795);
			RTC_WaitForLastTask();								//等待上一次操作完成*/
			
			
					MyRTC_SetTime();									//设置时间，调用此函数，全局数组里时间值刷新到RTC硬件电路
					
					BKP_WriteBackupRegister(BKP_DR1, 0xA5A5);			//在备份寄存器写入自己规定的标志位，用于判断RTC是不是第一次执行配置

		}else{
			
			//如果已经初始化过了就不用初始化了， 下面的代码是以防报错
			
					RTC_WaitForSynchro();								//等待同步
					RTC_WaitForLastTask();								//等待上一次操作完成
				
			}

	
}


void MyRTC_Init_LSI(void){
			/*开启时钟*/
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);		//开启PWR的时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_BKP, ENABLE);		//开启BKP的时钟
	
		/*备份寄存器访问使能*/
	PWR_BackupAccessCmd(ENABLE);							//使用PWR开启对备份寄存器的访问
	
	
	
	//给某个寄存器 设置任意值(我们设置是0xA5A5) 如果不是0xA5A5说明断电了/第一次进入
	if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5){//通过写入备份寄存器的标志位，判断RTC是否是第一次配置
		

		//开启LSI
			RCC_LSICmd(ENABLE);
			
			
			
			//读取 开启LSI的标志位
			while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) != SET);
			
			//配置时钟源
			RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI);
		 //RTCCLK使能
			RCC_RTCCLKCmd(ENABLE);
			
			
			RTC_WaitForSynchro();								//等待同步
			RTC_WaitForLastTask();								//等待上一次操作完成
				

				RTC_SetPrescaler(40000 - 1);						//设置RTC预分频器，预分频后的计数频率为1Hz
				RTC_WaitForLastTask();								//等待上一次操作完成
			
			//设置初始时间
			/*RTC_SetCounter(1672588795);
			RTC_WaitForLastTask();								//等待上一次操作完成*/
				MyRTC_SetTime();									//设置时间，调用此函数，全局数组里时间值刷新到RTC硬件电路

	
			BKP_WriteBackupRegister(BKP_DR1, 0xA5A5);

	}else{
					RCC_LSICmd(ENABLE);				//即使不是第一次配置，也需要再次开启LSI时钟
		while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) != SET);
		
		RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI);
		RCC_RTCCLKCmd(ENABLE);
			//如果已经初始化过了就不用初始化了， 下面的代码是以防报错
			
					RTC_WaitForSynchro();								//等待同步
					RTC_WaitForLastTask();								//等待上一次操作完成
				
	}			


	
}

/**
  * 函    数：RTC设置时间
  * 参    数：无
  * 返 回 值：无
  * 说    明：调用此函数后，全局数组里时间值将刷新到RTC硬件电路
  */
void MyRTC_SetTime(void)
{
	time_t time_cnt;		//定义秒计数器数据类型
	struct tm time_date;	//定义日期时间数据类型
	
	time_date.tm_year = MyRTC_Time[0] - 1900;		//将数组的时间赋值给日期时间结构体
	time_date.tm_mon = MyRTC_Time[1] - 1;
	time_date.tm_mday = MyRTC_Time[2];
	time_date.tm_hour = MyRTC_Time[3];
	time_date.tm_min = MyRTC_Time[4];
	time_date.tm_sec = MyRTC_Time[5];
	
	time_cnt = mktime(&time_date) - 8 * 60 * 60;	//调用mktime函数，将日期时间转换为秒计数器格式
													//- 8 * 60 * 60为东八区的时区调整
	
	RTC_SetCounter(time_cnt);						//将秒计数器写入到RTC的CNT中
	RTC_WaitForLastTask();							//等待上一次操作完成
}


/**
  * 函    数：RTC读取时间
  * 参    数：无
  * 返 回 值：无
  * 说    明：调用此函数后，RTC硬件电路里时间值将刷新到全局数组
  */
void MyRTC_ReadTime(void)
{
	time_t time_cnt;		//定义秒计数器数据类型
	struct tm time_date;	//定义日期时间数据类型
	
	time_cnt = RTC_GetCounter() + 8 * 60 * 60;		//读取RTC的CNT，获取当前的秒计数器
													//+ 8 * 60 * 60为东八区的时区调整
	
	time_date = *localtime(&time_cnt);				//使用localtime函数，将秒计数器转换为日期时间格式
	
	MyRTC_Time[0] = time_date.tm_year + 1900;		//将日期时间结构体赋值给数组的时间
	MyRTC_Time[1] = time_date.tm_mon + 1;
	MyRTC_Time[2] = time_date.tm_mday;
	MyRTC_Time[3] = time_date.tm_hour;
	MyRTC_Time[4] = time_date.tm_min;
	MyRTC_Time[5] = time_date.tm_sec;
}



